function fn(받으려는값) {
    받으려는값();
    console.log("fn함수 종료")
}

function 더하기함수(a, b) {
    let result = a + b;
    console.log(result)
    return result;
}

// 콜백 함수로 더하기함수를 호출한다.
fn(() => 더하기함수(3, 5)); 


//이 코드가 실행되는 순서는
// 1. fn(() => 더하기함수(3, 5));  라는 코드가 실행이되고 
// 2. "fn" 라는 함수를 찾게된다
// 3. "fn"이라는 함수는 1개의 값을 받는데 이 받는값을 "파라미터" 라고한다.
// 4. 그리고나서 받으려는값() <<가 실행이되는데 함수안에서 함수가 실행이되는것을 "콜백함수"라고한다.
// 5. 더하기 함수가 실행이되고 콘솔에 result ( 8 ) 이찍히게되고나서
// 6. 받으려는값()이 종료가되고 그후에 "fn함수 종료"가 찍히게된다
// 7. 이처럼 어떤함수가 실행되는 과정에서 다른함수가 실행이되는 방식을 설명하려 한것이다..?


function fn(받으려는값) {
    setTimeout(() => {
        받으려는값();
        console.log("fn함수 종료");
    }, 1000);
}

function 더하기함수(a, b) {
    let result = a + b;
    console.log(result);
}


fn(() => 더하기함수(3, 5));